ka2_2024/src/Documents/ПризнаниеРасходовПоИсследованиямИРазработкам/ПризнаниеРасходовПоИсследованиямИРазработкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПризнаниеРасходовПоИсследованиямИРазработкам</name>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.РасчетПризнанияРасходовНИОКР</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАкта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАкта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТемыЭтапыИсследованийИРазработок</name>
    <attributes>
      <name>ТемаЭтап</name>
      <type>
        <types>CatalogRef.ТемыЭтапыИсследованийИРазработок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Распределение</name>
    <attributes>
      <name>ВидПризнанияРасходовБУ</name>
      <type>
        <types>EnumRef.ВидыПризнанияРасходовПоИсследованиямИРазработкам</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходовБУ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходовБУ</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПризнанияРасходовНУ</name>
      <type>
        <types>EnumRef.ВидыПризнанияРасходовПоИсследованиямИРазработкам</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходовНУ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходовНУ</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПризнанияРасходовУУ</name>
      <type>
        <types>EnumRef.ВидыПризнанияРасходовПоИсследованиямИРазработкам</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходовУУ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходовУУ</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/Enums/ВидыПризнанияРасходовПоИсследованиямИРазработкам/ВидыПризнанияРасходовПоИсследованиямИРазработкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПризнанияРасходовПоИсследованиямИРазработкам</name>
  <enumValues>
    <name>ПризнаниеВСоставеНМА</name>
  </enumValues>
  <enumValues>
    <name>ПереносНаДругуюТему</name>
  </enumValues>
  <enumValues>
    <name>ВключитьВСоставПроизводственныхЗатрат</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытьТему</name>
  </enumValues>
  <enumValues>
    <name>НеВыполнятьПризнаниеРасходов</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеВСоставеРБП</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеВСоставеТекущихРасходов</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Enums/ОперацииЗакрытияМесяца/ОперацииЗакрытияМесяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииЗакрытияМесяца</name>
  <enumValues>
    <name>АктуализацияПараметровУзловКомпонентовАмортизации</name>
  </enumValues>
  <enumValues>
    <name>АннулированиеПодарочныхСертификатов</name>
  </enumValues>
  <enumValues>
    <name>ВводСведенийСреднесписочнойЧисленности</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеРасходовОтВыбытияОС</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчетовУчетаДоходовИРасходовМУ</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнениеФактическойСтоимостиВНАПриОтключенномУчетеСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>ИспользованиеНеверныхВариантовОтражения</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеДублейВидовЗапасов</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОтрицательныхОстатковТоваровОрганизаций</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОшибокВИсходныхДанных</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеРазвернутыхОстатковПоВзаиморасчетам</name>
  </enumValues>
  <enumValues>
    <name>НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ</name>
  </enumValues>
  <enumValues>
    <name>НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции</name>
  </enumValues>
  <enumValues>
    <name>НастройкаРаспределенияРасходов</name>
  </enumValues>
  <enumValues>
    <name>НастройкаРаспределенияРасходовВручную</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииНМА</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииОС</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииОСиНМАМеждународныйУчет</name>
  </enumValues>
  <enumValues>
    <name>НачислениеРезервовПоОплатеТруда</name>
  </enumValues>
  <enumValues>
    <name>НачислениеПроцентовПоАренде</name>
  </enumValues>
  <enumValues>
    <name>НачислениеСписаниеРезервовПредстоящихРасходов</name>
  </enumValues>
  <enumValues>
    <name>НачисленияПоКредитамДепозитамИВыданнымЗаймам</name>
  </enumValues>
  <enumValues>
    <name>ОбесценениеВНА</name>
  </enumValues>
  <enumValues>
    <name>ОсвобождениеОтУплатыНалоговВСвязиСКоронавирусом</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеДокументовВМеждународномУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеДокументовВРегламентированномУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеЗарплатыВФинансовомУчете</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеВыкупаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеВыработкиСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеДокументовРаспределенияРасходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОстатковПередачиВПереработку2_4</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОстатковПриемаВПереработку2_4</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОстатковТоваровКПередаче</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОтчетовДавальцам</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОтчетовКомитентамОСписании</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОтчетовПереработчиков</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОтчетовПоКомиссииМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПередачМатериаловВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПередачТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПроизводстваБезЗаказов</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСчетовФактурИТаможенныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ОчисткаДвиженийПриОтключенномУчетеСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>ПереоценкаАренды</name>
  </enumValues>
  <enumValues>
    <name>ПереоценкаДенежныхСредствИФинансовыхИнструментов</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаЕдиныйНалоговыйСчет</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаНовыеРежимыУчета</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаУчетВнеоборотныхАктивовВерсии24</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаУчетКурсовыхРазницНУПо67ФЗ</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНДСВБюджетПоОтдельнымОперациям</name>
  </enumValues>
  <enumValues>
    <name>ПланированиеПроизводстваПродукцииБезСпецификаций</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСтоимостиТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеВНалоговомУчетеАрендныхПлатежей</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеРасходовПоИсследованиямИРазработкам</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеРасходовПриУСН</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаКурсовЗачетаВАвансовыхОтчетах</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеДоходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеМатериаловИРаботНаСебестоимостьПродукции21</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеМатериаловИРаботНаСебестоимостьПродукции22</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеНДС</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовБудущихПериодов</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>РасчетЕНС</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗемельногоНалога</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазниц</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазницВВалютеПредставления</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазницВФункциональнойВалюте</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаУСН</name>
  </enumValues>
  <enumValues>
    <name>РасчетПартийИСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>РасчетПроцентныхРасходовДисконтирования</name>
  </enumValues>
  <enumValues>
    <name>РасчетСтоимостиВнеоборотныхАктивов</name>
  </enumValues>
  <enumValues>
    <name>РасчетТорговогоСбора</name>
  </enumValues>
  <enumValues>
    <name>РасчетТранспортногоНалога</name>
  </enumValues>
  <enumValues>
    <name>РеклассификацияДолгосрочныхАктивовОбязательств</name>
  </enumValues>
  <enumValues>
    <name>РеклассификацияДолгосрочныхАктивовОбязательствМУ</name>
    <comment>Реклассификация долгосрочных активов и обязательств в международном учете</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеЗатратНаВыпускБезРаспоряжений</name>
  </enumValues>
  <enumValues>
    <name>СторноДоходовКУДиР</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАмортизацияОС</name>
    <comment>Использовалось до версии 2.4</comment>
  </enumValues>
  <enumValues>
    <name>УдалитьИсправлениеОшибокКорреспонденцииФинансовыхРегистров</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПроверкаОшибокКорреспонденцииФинансовыхРегистров</name>
  </enumValues>
  <enumValues>
    <name>УстановкаДатыЗапретаФормированияПроводокМУ</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоВнеоборотнымАктивам</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеРезервовПодОбесценениеЗапасов</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеРезервовПоСомнительнымДолгам</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеСводныхСправокНДС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеФинансовогоРезультата</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Documents/ПризнаниеРасходовПоИсследованиямИРазработкам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ПараметрыВыбораСтатейИАналитик = Документы.ПризнаниеРасходовПоИсследованиямИРазработкам.ПараметрыВыбораСтатейИАналитик(ХозяйственнаяОперация);
	ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
	ИнициализироватьДокумент();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ТемыЭтапы") Тогда
			Для Каждого ТемаЭтап Из ДанныеЗаполнения.ТемыЭтапы Цикл
				НоваяСтрока = ТемыЭтапыИсследованийИРазработок.Добавить();
				НоваяСтрока.ТемаЭтап = ТемаЭтап;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ПараметрыВыбораСтатейИАналитик = Документы.ПризнаниеРасходовПоИсследованиямИРазработкам.ПараметрыВыбораСтатейИАналитик(ХозяйственнаяОперация);
	ДоходыИРасходыСервер.ПередЗаписью(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОбщегоНазначенияУТ.ЗаполнитьИдентификаторыДокумента(ЭтотОбъект, "Распределение")
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьАктуальностьЗакрытияТемыЭтапа(Отказ);
	
	Если Не Отказ Тогда
		
		ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
		СформироватьЗаданиеКЗакрытиюМесяца();
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
	СформироватьЗаданиеКЗакрытиюМесяца();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьЗаполнениеРеквизитовРаспределения(Отказ, ПроверяемыеРеквизиты);
	
	ПараметрыВыбораСтатейИАналитик = Документы.ПризнаниеРасходовПоИсследованиямИРазработкам.ПараметрыВыбораСтатейИАналитик(ХозяйственнаяОперация);
	ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбораСтатейИАналитик);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПроверяемыеРеквизитыРаспределения()
	
	ИспользуетсяРеглУчет = ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет");
	
	ПроверяемыеРеквизитыРаспределения = Новый ДеревоЗначений;
	ПроверяемыеРеквизитыРаспределения.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка"));
	ПроверяемыеРеквизитыРаспределения.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	ПроверяемыеРеквизитыРаспределения.Колонки.Добавить("НеПроверять", Новый ОписаниеТипов("Булево"));
	
	РеквизитВидРасхода = ПроверяемыеРеквизитыРаспределения.Строки.Добавить();
	РеквизитВидРасхода.ИмяРеквизита = "ВидПризнанияРасходовБУ";
	РеквизитВидРасхода.Представление = НСтр("ru = 'Вид признания БУ'");
	
	РеквизитСтатья = РеквизитВидРасхода.Строки.Добавить();
	РеквизитСтатья.ИмяРеквизита = "СтатьяРасходовБУ";
	РеквизитСтатья.Представление = НСтр("ru = 'Статья расходов БУ'");
	
	РеквизитАналитика = РеквизитСтатья.Строки.Добавить();
	РеквизитАналитика.ИмяРеквизита = "АналитикаРасходовБУ";
	РеквизитАналитика.Представление = НСтр("ru = 'Аналитика расходов БУ'");
	
	РеквизитВидРасхода = ПроверяемыеРеквизитыРаспределения.Строки.Добавить();
	РеквизитВидРасхода.ИмяРеквизита = "ВидПризнанияРасходовУУ";
	РеквизитВидРасхода.Представление = НСтр("ru = 'Вид признания УУ'");
	РеквизитВидРасхода.НеПроверять = Истина;
	
	РеквизитСтатья = РеквизитВидРасхода.Строки.Добавить();
	РеквизитСтатья.ИмяРеквизита = "СтатьяРасходовУУ";
	РеквизитСтатья.Представление = НСтр("ru = 'Статья расходов УУ'");
	
	РеквизитАналитика = РеквизитСтатья.Строки.Добавить();
	РеквизитАналитика.ИмяРеквизита = "АналитикаРасходовУУ";
	РеквизитАналитика.Представление = НСтр("ru = 'Аналитика расходов УУ'");
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗавершениеЭтаповИсследованийИРазработок
		И ИспользуетсяРеглУчет Тогда
		
		РеквизитВидРасхода = ПроверяемыеРеквизитыРаспределения.Строки.Добавить();
		РеквизитВидРасхода.ИмяРеквизита = "ВидПризнанияРасходовНУ";
		РеквизитВидРасхода.Представление = НСтр("ru = 'Вид признания НУ'");
		
		РеквизитСтатья = РеквизитВидРасхода.Строки.Добавить();
		РеквизитСтатья.ИмяРеквизита = "СтатьяРасходовНУ";
		РеквизитСтатья.Представление = НСтр("ru = 'Статья расходов НУ'");
		
		РеквизитАналитика = РеквизитСтатья.Строки.Добавить();
		РеквизитАналитика.ИмяРеквизита = "АналитикаРасходовНУ";
		РеквизитАналитика.Представление = НСтр("ru = 'Аналитика расходов НУ'");

	КонецЕсли;
	
	Возврат ПроверяемыеРеквизитыРаспределения;
	
КонецФункции

Функция ОбязательныеСтатьи()
	
	МассивСтатей = Новый Массив();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСтатей, Распределение.ВыгрузитьКолонку("СтатьяРасходовБУ"));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСтатей, Распределение.ВыгрузитьКолонку("СтатьяРасходовНУ"));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСтатей, Распределение.ВыгрузитьКолонку("СтатьяРасходовУУ"));
	МассивСтатей = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивСтатей);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Статьи.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|ГДЕ
	|	Статьи.Ссылка В (&МассивСтатей)
	|	И Статьи.КонтролироватьЗаполнениеАналитики");
	
	Запрос.УстановитьПараметр("МассивСтатей", МассивСтатей);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура ПроверитьЗаполнениеРеквизитовРаспределения(Отказ, ПроверяемыеРеквизиты)
	
	РаспределениеБезРазбиения = Ложь;
	Если ДополнительныеСвойства.Свойство("РаспределениеБезРазбиения")
		И ДополнительныеСвойства.РаспределениеБезРазбиения Тогда
		РаспределениеБезРазбиения = Истина;
	КонецЕсли;
	
	ПроверяемыеРеквизитыРаспределения = ПолучитьПроверяемыеРеквизитыРаспределения();
	ОбязательныеСтатьи = ОбязательныеСтатьи();
	Для Каждого СтрокаТаблицы Из Распределение Цикл
			
		ОшибкиПроверки = Новый Структура;
		
		Для Каждого ГруппаПоверяемыхРеквизитов Из ПроверяемыеРеквизитыРаспределения.Строки Цикл
			
			Если ЗначениеЗаполнено(СтрокаТаблицы[ГруппаПоверяемыхРеквизитов.ИмяРеквизита])
					И СтрокаТаблицы[ГруппаПоверяемыхРеквизитов.ИмяРеквизита] 
						<> Перечисления.ВидыПризнанияРасходовПоИсследованиямИРазработкам.НеВыполнятьПризнаниеРасходов Тогда
				
				Для Каждого РеквизитСтатья Из ГруппаПоверяемыхРеквизитов.Строки Цикл
					Если ЗначениеЗаполнено(СтрокаТаблицы[РеквизитСтатья.ИмяРеквизита]) Тогда
						Если Не (ОбязательныеСтатьи.Найти(СтрокаТаблицы[РеквизитСтатья.ИмяРеквизита]) = Неопределено) Тогда
							Для Каждого РеквизитАналитика Из РеквизитСтатья.Строки Цикл
								Если Не ЗначениеЗаполнено(СтрокаТаблицы[РеквизитАналитика.ИмяРеквизита]) Тогда
									ОшибкиПроверки.Вставить(РеквизитАналитика.ИмяРеквизита, РеквизитАналитика.Представление);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					Иначе
						ОшибкиПроверки.Вставить(РеквизитСтатья.ИмяРеквизита, РеквизитСтатья.Представление);
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТаблицы[ГруппаПоверяемыхРеквизитов.ИмяРеквизита])
				И ГруппаПоверяемыхРеквизитов.НеПроверять = Ложь Тогда	
				ОшибкиПроверки.Вставить(ГруппаПоверяемыхРеквизитов.ИмяРеквизита, ГруппаПоверяемыхРеквизитов.Представление);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ОшибкаПроверки Из ОшибкиПроверки Цикл
			
			ТекстОшибки = "";
			Поле = "";
			КлючДанных = Неопределено;
			
			Если РаспределениеБезРазбиения Тогда
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Не заполнено поле ""%1""'"), ОшибкаПроверки.Значение);
				Поле = "Элементы.РаспределениеЗавершенияЭтапа.ТекущиеДанные." + ОшибкаПроверки.Ключ;
			Иначе
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Не заполнено поле ""%1"" в строке %2 списка ""%3""'"),
					ОшибкаПроверки.Значение, СтрокаТаблицы.НомерСтроки, "Отнесение расходов");
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Распределение", СтрокаТаблицы.НомерСтроки, ОшибкаПроверки.Ключ);
				КлючДанных = ЭтотОбъект;
			КонецЕсли;
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки,
				КлючДанных,
				Поле,
				,
				Отказ);
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Процедура ИнициализироватьДокумент()
	
	Дата = НачалоДня(ТекущаяДатаСеанса());
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	
КонецПроцедуры

Процедура ПроверитьАктуальностьЗакрытияТемыЭтапа(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПризнаниеРасходовПоИсследованиямИРазработкамТемыЭтапыИсследованийИРазработок.ТемаЭтап КАК ТемаЭтап,
		|	ПризнаниеРасходовПоИсследованиямИРазработкамТемыЭтапыИсследованийИРазработок.Ссылка КАК ДокументЗавершения
		|ИЗ
		|	Документ.ПризнаниеРасходовПоИсследованиямИРазработкам.ТемыЭтапыИсследованийИРазработок КАК
		|		ПризнаниеРасходовПоИсследованиямИРазработкамТемыЭтапыИсследованийИРазработок
		|ГДЕ
		|	ПризнаниеРасходовПоИсследованиямИРазработкамТемыЭтапыИсследованийИРазработок.Ссылка.Дата
		|		МЕЖДУ &НачалоПериода И &КонецПериода
		|	И
		|		ПризнаниеРасходовПоИсследованиямИРазработкамТемыЭтапыИсследованийИРазработок.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
		|	И ПризнаниеРасходовПоИсследованиямИРазработкамТемыЭтапыИсследованийИРазработок.Ссылка.Организация = &Организация
		|	И ПризнаниеРасходовПоИсследованиямИРазработкамТемыЭтапыИсследованийИРазработок.Ссылка.Проведен
		|	И ПризнаниеРасходовПоИсследованиямИРазработкамТемыЭтапыИсследованийИРазработок.Ссылка <> &ТекущийДокумент
		|	И ПризнаниеРасходовПоИсследованиямИРазработкамТемыЭтапыИсследованийИРазработок.ТемаЭтап В (&ТемыЭтапы)
		|СГРУППИРОВАТЬ ПО
		|	ПризнаниеРасходовПоИсследованиямИРазработкамТемыЭтапыИсследованийИРазработок.ТемаЭтап,
		|	ПризнаниеРасходовПоИсследованиямИРазработкамТемыЭтапыИсследованийИРазработок.Ссылка";
	
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТемыЭтапы", ТемыЭтапыИсследованийИРазработок.ВыгрузитьКолонку("ТемаЭтап"));
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ТекстСообщения = НСтр("ru = 'Для %1 в данном периоде уже введен документ %2. Необходимо отменить проведение предыдущего документа'");
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(ТекстСообщения, ВыборкаДетальныеЗаписи.ТемаЭтап, ВыборкаДетальныеЗаписи.ДокументЗавершения)
				,,,,Отказ);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьЗаданиеКЗакрытиюМесяца()

	МассивОрганизаций = Новый Массив();
	МассивОрганизаций.Добавить(Организация);
	 
	ПериодРасчета = ЗакрытиеМесяцаСервер.НачалоРасчета(Перечисления.ОперацииЗакрытияМесяца.ПризнаниеРасходовПоИсследованиямИРазработкам,
		КонецМесяца(Дата),,МассивОрганизаций);
	Если ПериодРасчета > Дата Тогда
		РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьЗаписьРегистра(
			НачалоМесяца(Дата), Ссылка, Организация, Перечисления.ОперацииЗакрытияМесяца.ПризнаниеРасходовПоИсследованиямИРазработкам);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
